
#include <stdio.h>

int main()
{
    char *C[] = {"E","N","W","S","E","N"};
    int day, month, A, N;
    int swt = 0, num;
    char *months[] = {"января", "февраля", "марта", "апреля", "мая", "июня", "июля",
    "августа", "сентября", "октября", "ноября", "декабря"};
    char *days[] = {"первое", "второе", "третье", "четвертое", "пятое", 
    "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое",
    "двенадцатое", "тренадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое",
    "семьнадцатое", "восемьнадцатое", "девятнадцатое", "двадцатое", "двадцать первое",
    "двадцать второе", "двадцать третье", "двадцать четвертое", "двадцать пятое", 
    "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое",
    "тридцатое", "тридцать первое"};
    char *zad[] = {"десять", "одиннадцать", "двенадцать", "тренадцать", "четырнадцать", "пятнадцать",
    "шестнадцать", "семьнадцать", "восемьнадцать", "девятнадцать", "двадцать", "двадцать одно", "двадцать два",
        "двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь",
        "двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять",
        "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок"};
    char *sto[] = {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    char *des[] = {"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    char *odin[] = {"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    char *cvet[] = {"зеленой", "красной", "желтой", "белой", "черной", "зеленого", "красного", "желтого", "белого", "черного"};
    char *zver[] = {"крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезьяны", "курицы", "собаки", "свиньи"};
    while (swt<1){
        printf("Введите номер задания\n");
        scanf("%d", &num);
        switch(num){
            case 1:
                printf("Введите день и месяц (в числах):\n");
                scanf("%d%d", &day, &month);
                printf("%s %s\n\n", days[day - 1], months[month - 1]);
                break;
            case 2:
                printf("Введите направление 1-Север, 2-Запад, 3-Юг, 4-Восток:\n");
                scanf("%d", &A);
                printf("Введите новое направление 1 - налево, -1 - направо, 0 - не менять:\n");
                scanf("%d", &N);
                printf("Новое напрвление - %s\n\n", C[A+(N*-1)]);
                break;
            case 3:
                printf("Введите число от 10 до 40:\n");
                scanf("%d", &A);
                if((A>9 && A<21)||(A>24 && A<31)||(A>34 && A<41)){
                    printf("%s учебных заданий\n\n", zad[A - 10]);
                }
                else if(A==21 || A==31){
                    printf("%s учебное задание\n\n", zad[A - 10]);
                }
                else{
                    printf("%s учебных задания\n\n", zad[A - 10]);
                }
                break;
            case 4:
                printf("Введите число от 100 до 999:\n");
                scanf("%d", &A);
                if(A/10%10 == 1){
                    printf("%s %s\n\n", sto[A/100 - 1], zad[A%100 - 10]);
                }
                else{
                    printf("%s %s %s\n\n", sto[A/100 - 1], des[A/10%10], odin[A%10]);
                }
                break;
            case 5:
                printf("Введите год:\n\n");
                scanf("%d", &A);
                N = A;
                while(A>11){
                    A-=12;
                }
                A-=4;
                if(A<0){
                    A+=12;
                }
                while(N>63){
                    N-=60;
                }
                N-=4;
                if(N<0){
                    N+=60;
                }
                if(N>4){
                    while(N>4){
                        N/=12;
                    }
                }
                else{
                    N/=12;
                }
                if(A==2 || A==3 || A==4){
                    printf("год %s %s\n\n", cvet[N + 5], zver[A]);
                }
                else{
                    printf("год %s %s\n\n", cvet[N], zver[A]);
                }
                break;
            default:
                swt+=1;
                break;
        }
    }
    return 0;
}


